<template>
	<div class="flex-grow task px-4 py-8 md:px-20 md:py-20 shadow-md">
		<h1 class="font-bold text-3xl pb-4">
			Тестовое задание на позицию <br />«Frontend-разработчик»
		</h1>
		<p class="py-3">
			Вам предлагается выполнить <b>два задания: практическое</b>, для
			демонстрации навыков создания компонентов и <b>теоретическое</b> — для
			демонстрации общего опыта. По обеим задачам необходимо описать затраченное
			время (с учётом времени на поиск информации, чтение документации и т.п.).
			По теоретической части дополнительно — список использованных инструментов.
		</p>
		<h2 class="font-bold text-xl py-4">Задача 1 — практическая</h2>
		<p>
			Необходимо сделать виджет (vue-js компонент) для вывода дерева рубрик
			сайта. Имеется АПИ
			<a href="https://www.klerk.ru/yindex.php/v3/event/rubrics"
				>https://www.klerk.ru/yindex.php/v3/event/rubrics</a
			>
			возвращающее дерево рубрик мероприятий и параметр ?allowEmpty=1 который
			позволяет вернуть больше рубрик (в том числе и рубрики в которых нет
			мероприятий).
		</p>
		<ul class="list-decimal pt-4 pb-2">
			Компонент должен:
			<li>выводить дерево,</li>
			<li>
				позволять сворачивать визуально ветки на любом уровне включая корень,
			</li>
			<li>
				должны быть галочка Отображать пустые рубрики, которая влияет на
				параметр allowEmpty,
			</li>
			<li>
				Каждая рубрика должна быть ссылкой (в АПИ передаётся относительный адрес
				на <a href="https://www.klerk.ru">https://www.klerk.ru</a>),
			</li>
			<li>
				рядом с каждой рубрикой надо отобразить в скобках два числа: count -
				есть в АПИ и сумму count-ов данного элемента и всех его дочерних
				элементов.
			</li>
			<li>
				Возле каждого элемента также должен быть чекбокс, и выше дерева должна
				выводиться сумма count-ов всех элементов, отмеченных чекбоксами (вместе
				с дочерними элементами отмеченных элементов).
			</li>
		</ul>
		<h3 class="font-bold text-lg py-2">Условия:</h3>
		<p>
			Выложить виджет на какой-нибудь онлайн-платформе, типа jsfiddle, codepen.
		</p>
		<h2 class="font-bold text-xl py-4">Задача 2 — теоретическая</h2>
		<p>
			Откройте главную страницу сайта
			<a href="https://www.klerk.ru">https://www.klerk.ru</a>. Используя любые
			известные вам инструменты опишите 2-3 направления, как бы вы решали
			задачу, сформулированную как «Необходимо увеличить производительность
			главной страницы сайта, сократить время ожидания пользователя,
			открывающего главную страницу»
		</p>
		<h3 class="font-bold text-lg py-2">Условия:</h3>
		<p>
			Так как вы не видите кода, в данной задаче имеются в виду общие принципы
			оптимизации и умение искать узкие места при помощи известных вам
			инструментов. В качестве решения надо предоставить 1 - 2 абзаца текста с
			описанием подходов, использованных инструментов и затраченного на анализ
			времени.
		</p>
	</div>
</template>

<script>
export default {};
</script>

<style scoped>
.task {
	margin: 0 auto;
	max-width: 900px;
	background: white;
	color: black;
	font-size: 17px;
}
li {
	margin-left: 30px;
}
a {
	color: blue;
}
a:hover {
	color: green;
}
</style>
